# CreateInteger Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateInteger Method
IFCData Class See Also
---
Creates an integer data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateInteger(
	int value
)
```

Visual Basic
---
```text
Public Shared Function CreateInteger ( _
	value As Integer _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateInteger(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32 The integer value.
# ### Return Value
The IFCData object.
# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace